[Killed] BooleanLiteral
src/pages/LoginPage.jsx:14:48
   // --- All backend logic is injected here ---
   const [identifier, setIdentifier] = useState('');
   const [password, setPassword] = useState('');
-  const [rememberMe, setRememberMe] = useState(false);
+  const [rememberMe, setRememberMe] = useState(true);
   const [error, setError] = useState('');
   const [loading, setLoading] = useState(false);
killedBy: LoginPage Component handles successful login with "Remember Me" (Local Storage)
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  checked=""
  class="h-4 w-4 rounded bg-[#3a3a3a] border-[#18d4d1] text-[#18d4d1] focus:ring-[#18d4d1]"
  type="checkbox"
/>

[Survived] StringLiteral
src/pages/LoginPage.jsx:21:14
 
   const handleSubmit = async (e) => {
     e.preventDefault();
-    setError('');
+    setError("Stryker was here!");
     setLoading(true);
     try {

[Killed] BlockStatement
src/pages/LoginPage.jsx:23:9
     e.preventDefault();
     setError('');
     setLoading(true);
-    try {
-      const response = await fetch(`${API_BASE_URL}/api/auth/login`, {
-        method: 'POST',
-        credentials: 'include',
-        headers: { 'Content-Type': 'application/json' },
-        body: JSON.stringify({ identifier, password })
-      });
-      const data = await response.json();
-      if (data.success) {
-        const storage = rememberMe ? localStorage : sessionStorage;
-        if (data.token) storage.setItem('token', data.token);
-        if (data.user) storage.setItem('user', JSON.stringify(data.user));
-        navigate('/dashboard');
-      } else {
-        setError(data.message || 'Login failed');
-      }
-    } catch (err) {
+    try {} catch (err) {
       console.error('Login error:', err);
       setError(err.message || 'Network error - could not connect to server');
killedBy: LoginPage Component handles successful login (Default: Session Storage)
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Signing in...
Received:
  Sign In

[Survived] StringLiteral
src/pages/LoginPage.jsx:27:36
       const response = await fetch(`${API_BASE_URL}/api/auth/login`, {
         method: 'POST',
         credentials: 'include',
-        headers: { 'Content-Type': 'application/json' },
+        headers: { 'Content-Type': "" },
         body: JSON.stringify({ identifier, password })
       });

[Killed] ObjectLiteral
src/pages/LoginPage.jsx:28:30
         method: 'POST',
         credentials: 'include',
         headers: { 'Content-Type': 'application/json' },
-        body: JSON.stringify({ identifier, password })
+        body: JSON.stringify({})
       });
       const data = await response.json();
killedBy: LoginPage Component handles successful login (Default: Session Storage)
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "http://mock-api.com/api/auth/login",

[Killed] ConditionalExpression
src/pages/LoginPage.jsx:31:11
         body: JSON.stringify({ identifier, password })
       });
       const data = await response.json();
-      if (data.success) {
+      if (true) {
         const storage = rememberMe ? localStorage : sessionStorage;
         if (data.token) storage.setItem('token', data.token);
killedBy: LoginPage Component handles API failure (success: false)
statusReason: Unable to find an element with the text: Invalid credentials. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tracking-wide flex items-center justify-center min-h-screen bg-cover bg-center relative px-4"

[Killed] ConditionalExpression
src/pages/LoginPage.jsx:33:13
       const data = await response.json();
       if (data.success) {
         const storage = rememberMe ? localStorage : sessionStorage;
-        if (data.token) storage.setItem('token', data.token);
+        if (false) storage.setItem('token', data.token);
         if (data.user) storage.setItem('user', JSON.stringify(data.user));
         navigate('/dashboard');
killedBy: LoginPage Component handles successful login (Default: Session Storage)
statusReason: expected "vi.fn()" to be called with arguments: [ 'token', 'fake-token' ]

Received: 

  1st vi.fn() call:

  [
-   "token",

[Survived] ConditionalExpression
src/pages/LoginPage.jsx:33:13
       const data = await response.json();
       if (data.success) {
         const storage = rememberMe ? localStorage : sessionStorage;
-        if (data.token) storage.setItem('token', data.token);
+        if (true) storage.setItem('token', data.token);
         if (data.user) storage.setItem('user', JSON.stringify(data.user));
         navigate('/dashboard');

[Killed] ConditionalExpression
src/pages/LoginPage.jsx:34:13
       if (data.success) {
         const storage = rememberMe ? localStorage : sessionStorage;
         if (data.token) storage.setItem('token', data.token);
-        if (data.user) storage.setItem('user', JSON.stringify(data.user));
+        if (false) storage.setItem('user', JSON.stringify(data.user));
         navigate('/dashboard');
       } else {
killedBy: LoginPage Component handles successful login (Default: Session Storage)
statusReason: expected "vi.fn()" to be called with arguments: [ 'user', '{"id":1}' ]

Received: 

  1st vi.fn() call:

  [
-   "user",

[Survived] ConditionalExpression
src/pages/LoginPage.jsx:34:13
       if (data.success) {
         const storage = rememberMe ? localStorage : sessionStorage;
         if (data.token) storage.setItem('token', data.token);
-        if (data.user) storage.setItem('user', JSON.stringify(data.user));
+        if (true) storage.setItem('user', JSON.stringify(data.user));
         navigate('/dashboard');
       } else {

[Killed] StringLiteral
src/pages/LoginPage.jsx:35:18
         const storage = rememberMe ? localStorage : sessionStorage;
         if (data.token) storage.setItem('token', data.token);
         if (data.user) storage.setItem('user', JSON.stringify(data.user));
-        navigate('/dashboard');
+        navigate("");
       } else {
         setError(data.message || 'Login failed');
killedBy: LoginPage Component handles successful login (Default: Session Storage)
statusReason: expected "vi.fn()" to be called with arguments: [ '/dashboard' ]

Received: 

  1st vi.fn() call:

  [
-   "/dashboard",

[Killed] BlockStatement
src/pages/LoginPage.jsx:36:14
         if (data.token) storage.setItem('token', data.token);
         if (data.user) storage.setItem('user', JSON.stringify(data.user));
         navigate('/dashboard');
-      } else {
-        setError(data.message || 'Login failed');
-      }
+      } else {}
     } catch (err) {
       console.error('Login error:', err);
killedBy: LoginPage Component handles API failure (success: false)
statusReason: Unable to find an element with the text: Invalid credentials. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tracking-wide flex items-center justify-center min-h-screen bg-cover bg-center relative px-4"

[Killed] ConditionalExpression
src/pages/LoginPage.jsx:37:18
         if (data.user) storage.setItem('user', JSON.stringify(data.user));
         navigate('/dashboard');
       } else {
-        setError(data.message || 'Login failed');
+        setError(true);
       }
     } catch (err) {
killedBy: LoginPage Component handles API failure (success: false)
statusReason: Unable to find an element with the text: Invalid credentials. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tracking-wide flex items-center justify-center min-h-screen bg-cover bg-center relative px-4"

[Killed] ConditionalExpression
src/pages/LoginPage.jsx:37:18
         if (data.user) storage.setItem('user', JSON.stringify(data.user));
         navigate('/dashboard');
       } else {
-        setError(data.message || 'Login failed');
+        setError(false);
       }
     } catch (err) {
killedBy: LoginPage Component handles API failure (success: false)
statusReason: Unable to find an element with the text: Invalid credentials. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tracking-wide flex items-center justify-center min-h-screen bg-cover bg-center relative px-4"

[Killed] BlockStatement
src/pages/LoginPage.jsx:39:19
       } else {
         setError(data.message || 'Login failed');
       }
-    } catch (err) {
-      console.error('Login error:', err);
-      setError(err.message || 'Network error - could not connect to server');
-    }
+    } catch (err) {}
     setLoading(false);
   };
killedBy: LoginPage Component handles Network Errors (fetch throws)
statusReason: Unable to find an element with the text: /Server offline/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tracking-wide flex items-center justify-center min-h-screen bg-cover bg-center relative px-4"

[Killed] LogicalOperator
src/pages/LoginPage.jsx:41:16
       }
     } catch (err) {
       console.error('Login error:', err);
-      setError(err.message || 'Network error - could not connect to server');
+      setError(err.message && 'Network error - could not connect to server');
     }
     setLoading(false);
killedBy: LoginPage Component handles Network Errors (fetch throws)
statusReason: Unable to find an element with the text: /Server offline/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tracking-wide flex items-center justify-center min-h-screen bg-cover bg-center relative px-4"

[Killed] ConditionalExpression
src/pages/LoginPage.jsx:41:16
       }
     } catch (err) {
       console.error('Login error:', err);
-      setError(err.message || 'Network error - could not connect to server');
+      setError(false);
     }
     setLoading(false);
killedBy: LoginPage Component handles Network Errors (fetch throws)
statusReason: Unable to find an element with the text: /Server offline/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tracking-wide flex items-center justify-center min-h-screen bg-cover bg-center relative px-4"

[Killed] ArrowFunction
src/pages/LoginPage.jsx:95:27
                 placeholder="Email or username"
                 value={identifier} // Logic injected
-                onChange={e => setIdentifier(e.target.value)} // Logic injected
+                onChange={() => undefined} // Logic injected
               />
             </div>
killedBy: LoginPage Component updates state when user types in inputs
statusReason: expected '' to be 'testuser' // Object.is equality

[Killed] ArrowFunction
src/pages/LoginPage.jsx:111:27
                 placeholder="••••••••"
                 value={password} // Logic injected
-                onChange={e => setPassword(e.target.value)} // Logic injected
+                onChange={() => undefined} // Logic injected
               />
             </div>
killedBy: LoginPage Component updates state when user types in inputs
statusReason: expected '' to be 'mysecretpass' // Object.is equality

[Killed] ArrowFunction
src/pages/LoginPage.jsx:123:27
                 type="checkbox"
                 className="h-4 w-4 rounded bg-[#3a3a3a] border-[#18d4d1] text-[#18d4d1] focus:ring-[#18d4d1]"
                 checked={rememberMe}
-                onChange={e => setRememberMe(e.target.checked)}
+                onChange={() => undefined}
               />
               Remember me
killedBy: LoginPage Component handles successful login with "Remember Me" (Local Storage)
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="h-4 w-4 rounded bg-[#3a3a3a] border-[#18d4d1] text-[#18d4d1] focus:ring-[#18d4d1]"
  type="checkbox"
/>

[Killed] ConditionalExpression
src/pages/LoginPage.jsx:133:12
           </div>
 
           {/* Error Message Display */}
-          {error && (
-            <div className="text-center text-red-400 text-sm font-medium">
-              {error}
-            </div>
-          )}
+          {true}
 
           {/* Your MainButton, now with loading logic */}
killedBy: LoginPage Component handles API failure (success: false)
statusReason: Unable to find an element with the text: Invalid credentials. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tracking-wide flex items-center justify-center min-h-screen bg-cover bg-center relative px-4"

[Killed] ConditionalExpression
src/pages/LoginPage.jsx:133:12
           </div>
 
           {/* Error Message Display */}
-          {error && (
-            <div className="text-center text-red-400 text-sm font-medium">
-              {error}
-            </div>
-          )}
+          {false}
 
           {/* Your MainButton, now with loading logic */}
killedBy: LoginPage Component handles API failure (success: false)
statusReason: Unable to find an element with the text: Invalid credentials. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tracking-wide flex items-center justify-center min-h-screen bg-cover bg-center relative px-4"
